lvx/base/InformationRegisters/бит_УстановленныеВизы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_УстановленныеВизы</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь, установивший визу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>Физическое лицо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДобавленаВручную</Name>
					<Comment>Добавлена вручную</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Comment>Дата и время установки визы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСортировки</Name>
					<Comment>Код сортировки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Решение</Name>
					<Comment>Решение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыРешенийСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Маршрут</Name>
					<Comment>Маршрут</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Алгоритм</Name>
					<Comment>Алгоритм</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочкаАлгоритма</Name>
					<Comment>Точка алгоритма</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТочкиАлгоритмов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКрайняя</Name>
					<Comment>Крайняя дата установки визы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНаУстановку</Name>
					<Comment>Время на установку (минут)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭПДействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктивнаяВиза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещеноТелеграм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещеноПочта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыВизирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Виза</Name>
					<Comment>Виза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Comment>Идентификатор</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/CommonModules/бит_ЭлектронныеПодписи/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура обновляет статус проверки подписи.
//
// Параметры:
//  РезультатПроверкиПодписи - Строка.
//  ИДПодписи
//  ОбъектПодписи
//  СтатусПроверкиПодписи
//
Процедура ОбновитьСтатусПроверкиПодписи(РезультатПроверкиПодписи, ИДПодписи, ОбъектПодписи, СтатусПроверкиПодписи) Экспорт

	Выборка = ПолучитьЭлектронныеПодписи(ОбъектПодписи,,, ИДПодписи);
	Если Выборка.Следующий() Тогда
		Подпись = РегистрыСведений.бит_ЭлектронныеПодписи.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Подпись, Выборка);
		Подпись.Прочитать();
		Если Не Подпись.Выбран() Тогда
			ВызватьИсключение НСтр("ru='Подпись не найдена.';en='Signature is not found.'");
		КонецЕсли;
	Иначе
		ВызватьИсключение НСтр("ru='Подпись не найдена.';en='Signature is not found.'");
	КонецЕсли;
	
	Если ТипЗнч(РезультатПроверкиПодписи) = Тип("Булево") Тогда
		Подпись.ПодписьВерна = РезультатПроверкиПодписи;
		Подпись.СертификатДействителен = РезультатПроверкиПодписи;
		
	ИначеЕсли ТипЗнч(РезультатПроверкиПодписи) = Тип("Структура") Тогда		
		Подпись.ПодписьВерна = Не РезультатПроверкиПодписи.Свойство("ТекстОшибкиПроверкиПодписи");
		Подпись.СертификатДействителен = Не РезультатПроверкиПодписи.Свойство("ТекстОшибкиПроверкиСертификата");
	КонецЕсли;
	
	Если ТипЗнч(РезультатПроверкиПодписи) = Тип("Структура") И РезультатПроверкиПодписи.Свойство("ТекстОшибкиПроверкиПодписи") Тогда
		Подпись.ТекстОшибкиПроверкиПодписи = РезультатПроверкиПодписи.ТекстОшибкиПроверкиПодписи;
	Иначе
		Подпись.ТекстОшибкиПроверкиПодписи = "";
	КонецЕсли;
	Если ТипЗнч(РезультатПроверкиПодписи) = Тип("Структура") И РезультатПроверкиПодписи.Свойство("ТекстОшибкиПроверкиСертификата") Тогда
		Подпись.ТекстОшибкиПроверкиСертификата = РезультатПроверкиПодписи.ТекстОшибкиПроверкиСертификата;
	Иначе
		Подпись.ТекстОшибкиПроверкиСертификата = "";
	КонецЕсли;

	Подпись.ДатаПроверкиПодписи = ТекущаяДатаСеанса();
	
	Подпись.Записать();
	
	СтатусПроверкиПодписи = ПолучитьОбщийСтатусПроверкиПодписи(Подпись.ПодписьВерна, Подпись.СертификатДействителен, Подпись.ДатаПроверкиПодписи);
	
КонецПроцедуры // ОбновитьСтатусПроверкиПодписи()

// Формирует строку общего статуса проверки подписи
//
Функция ПолучитьОбщийСтатусПроверкиПодписи(Знач ПодписьВерна, Знач СертификатДействителен,
	Знач ДатаПроверкиПодписи) Экспорт
	
	ДатаПроверкиПодписи = Формат(ДатаПроверкиПодписи, "ДФ='dd.MM.yyyy HH:mm'");
	
	Если Не ЗначениеЗаполнено(ДатаПроверкиПодписи) Тогда
		Возврат НСтр("ru='Не проверена';en='Not checked'");
	КонецЕсли;
	
	Если Не ПодписьВерна Тогда
		ТекстСообщения = НСтр("ru='Недействительна (%1)';en='Invalid (%1)'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ДатаПроверкиПодписи);
		Возврат ТекстСообщения;
	КонецЕсли;
	
	Если Не СертификатДействителен Тогда
		ТекстСообщения = НСтр("ru='Действительна, но нет доверия к сертификату (%1)';
							  |en='Indeed, but do not trust the certificate (%1)'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ДатаПроверкиПодписи);
		Возврат ТекстСообщения;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Действительна (%1)';en='Valid (%1)'");
	ТекстСообщения = ТекстСообщения;
	
КонецФункции

// Процедура находит запись в регистре сведений "бит_ЭлектронныеПодписи" с отбором
// и очищает ее.
//
// Параметры:
//  ИД - Строка.
//  ОбъектПодписи - Объект.
//
Процедура ПроверитьУдалитьПодписьВизы(ИД, ОбъектПодписи) Экспорт

	НаборЗаписей = РегистрыСведений.бит_ЭлектронныеПодписи.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИД.Установить(ИД);
	НаборЗаписей.Отбор.Объект.Установить(ОбъектПодписи);
	НаборЗаписей.Прочитать(); 
	НаборЗаписей.Очистить(); 
	НаборЗаписей.Записать(Истина); 
			
КонецПроцедуры // ПроверитьУдалитьПодписьВизы()

// Возвращает первую найденную подпись к объекту, в ином случае возвращает Неопределено.
//
Функция ПолучитьЭлектроннуюПодпись(ПодписанныйОбъект,
	УстановившийПодпись = Неопределено, ДатаПодписи = Неопределено, УникальныйИдентификатор = Неопределено) Экспорт
	
	Выборка = ПолучитьЭлектронныеПодписи(ПодписанныйОбъект.Ссылка, УстановившийПодпись, ДатаПодписи, УникальныйИдентификатор);
	Если Выборка.Следующий() Тогда
		Подпись = РегистрыСведений.бит_ЭлектронныеПодписи.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Подпись, Выборка);
		Подпись.Прочитать();
		Если Не Подпись.Выбран() Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат Подпись;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Формирует строку статуса проверки подписи
//
Функция ПолучитьСтатусПроверкиПодписи(Знач ДатаПроверкиПодписи, Знач ПодписьВерна,
	Знач ТекстОшибкиПроверкиПодписи) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаПроверкиПодписи) Тогда
		Возврат НСтр("ru='Не проверена';en='Not checked'");
	КонецЕсли;
	
	Если ПодписьВерна Тогда
		Возврат НСтр("ru='Действительна';en='Valid'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибкиПроверкиПодписи) Тогда
		Возврат ТекстОшибкиПроверкиПодписи;
	КонецЕсли;
	
	Возврат НСтр("ru='Недействительна';en='Invalid'");
	
КонецФункции

// Формирует строку статуса проверки сертификата
//
Функция ПолучитьСтатусПроверкиСертификата(Знач ДатаПроверкиПодписи, Знач СертификатДействителен,
	Знач ТекстОшибкиПроверкиСертификата) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаПроверкиПодписи)
		ИЛИ (
			ЗначениеЗаполнено(ДатаПроверкиПодписи)
			И Не СертификатДействителен
			И Не ЗначениеЗаполнено(ТекстОшибкиПроверкиСертификата)
		) Тогда
			
		Возврат НСтр("ru='Не проверен';en='Not checked'");
	КонецЕсли;
	
	Если СертификатДействителен Тогда
		Возврат НСтр("ru='Действителен';en='Valid'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибкиПроверкиСертификата) Тогда
		Возврат ТекстОшибкиПроверкиСертификата;
	КонецЕсли;
	
	Возврат НСтр("ru='Недействителен';en='Invalid'");
	
КонецФункции

// Сохраняет информацию о ЭП.
//
Процедура ЗанестиИнформациюОПодписи(ПараметрыПодписи) Экспорт
	
	ДатаПодписиИзФайла = ЭлектроннаяПодпись.ДатаПодписания(ПараметрыПодписи.СвойстваПодписи.Подпись);
	
	ПодписьЗагруженаИзФайла = (ПараметрыПодписи.СвойстваПодписи.ДатаПодписи = Неопределено);
	
	// Устанавливаем текущую дату сеанса в качестве даты создания подписи,
	// если последнюю не получилось извлечь из двоичных данных.
	Если ЗначениеЗаполнено(ДатаПодписиИзФайла) Тогда
		ДатаПодписи = ДатаПодписиИзФайла;
	ИначеЕсли Не ЗначениеЗаполнено(ПараметрыПодписи.СвойстваПодписи.ДатаПодписи) Тогда
		ДатаПодписи = ТекущаяДатаСеанса();
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.бит_ЭлектронныеПодписи.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИД          = ПараметрыПодписи.ИД;
	МенеджерЗаписи.Виза        = ПараметрыПодписи.Виза;
	МенеджерЗаписи.ДатаПодписи = ДатаПодписи;
	МенеджерЗаписи.Объект      = ПараметрыПодписи.Объект;
	МенеджерЗаписи.УстановившийПодпись = Пользователи.АвторизованныйПользователь();
	МенеджерЗаписи.Версия      = 3; // актуальная версия подписываемых данных на текущий момент
	МенеджерЗаписи.Комментарий = ПараметрыПодписи.СвойстваПодписи.Комментарий;
	МенеджерЗаписи.КомуВыданСертификат = ПараметрыПодписи.СвойстваПодписи.КомуВыданСертификат;
	МенеджерЗаписи.Отпечаток   = ПараметрыПодписи.СвойстваПодписи.Отпечаток;
	МенеджерЗаписи.Подпись     = Новый ХранилищеЗначения(ПараметрыПодписи.СвойстваПодписи.Подпись);
	МенеджерЗаписи.Сертификат  = Новый ХранилищеЗначения(ПараметрыПодписи.СвойстваПодписи.Сертификат); 

	МенеджерЗаписи.ДатаПроверкиПодписи    = ДатаПодписи;
	МенеджерЗаписи.ПодписьВерна           = Истина;
	МенеджерЗаписи.СертификатДействителен = Истина;
	
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);

		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки); 
	КонецПопытки;
	
КонецПроцедуры

// Процедура записывает информацию о подписи в регистр сведений "бит_УстановленныеВизы". 
//
// Параметры:
//  ИД 						 - Строка.
//  ОбъектПодписи 			 - ДокументОбъект.
//  ТипСобытия 				 - СТрока.
//  РезультатПроверкиПОдписи - Структура, Булево.
//
Процедура ЗаписатьДанныеПодписиВРегистрУстановленныеВизы(ИД, ОбъектПодписи, ТипСобытия, РезультатПроверкиПОдписи = Неопределено) Экспорт

	НаборЗаписей = РегистрыСведений.бит_УстановленныеВизы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИД.Установить(ИД);
	НаборЗаписей.Отбор.Объект.Установить(ОбъектПодписи);
	НаборЗаписей.Прочитать();
	
	Для Каждого Набор Из НаборЗаписей Цикл
		Если ТипСобытия = "Подпись" Тогда
			Набор.ПодписанЭП      = Истина;
			Набор.ЭПДействительна = Истина;
		Иначе
			Набор.ЭПДействительна = РезультатПроверкиПОдписи;
		КонецЕсли;
		
		Прервать;
	КонецЦикла;
	
	Если НаборЗаписей.ПроверитьЗаполнение() Тогда
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);

			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки); 
		КонецПопытки;	
	КонецЕсли;	
	
КонецПроцедуры // ЗаписатьДанныеПодписиВРегистр()

// Функция определяет доступность функционала для работы с электронными подписями.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат - Булево.
//
Функция ДоступенФункционалЭП() Экспорт

	Результат = Ложь;
	
	Если Константы.ИспользоватьЭлектронныеПодписи.Получить() И КОнстанты.бит_ИспользоватьЭлектронныеПодписи.Получить() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ДоступенФункционалЭП()
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает подписи, принадлежащие объекту.
//
Функция ПолучитьЭлектронныеПодписи(ПодписанныйОбъектСсылка, УстановившийПодпись = Неопределено,
	ДатаПодписи = Неопределено, УникальныйИдентификатор = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭП.Объект,
		|	ЭП.ИД,
		|	ЭП.ДатаПодписи,
		|	ЭП.УстановившийПодпись,
		|	ЭП.Версия,
		|	ЭП.ДатаПроверкиПодписи,
		|	ЭП.ИмяФайлаПодписи,
		|	ЭП.Комментарий,
		|	ЭП.КомуВыданСертификат,
		|	ЭП.Отпечаток,
		|	ЭП.Подпись,
		|	ЭП.ПодписьВерна,
		|	ЭП.Сертификат,
		|	ЭП.СертификатДействителен,
		|	ЭП.ТекстОшибкиПроверкиПодписи,
		|	ЭП.ТекстОшибкиПроверкиСертификата
		|ИЗ
		|	РегистрСведений.бит_ЭлектронныеПодписи КАК ЭП
		|ГДЕ
		|	ЭП.Объект = &ОбъектПодписи";
		
	Запрос.Параметры.Вставить("ОбъектПодписи", ПодписанныйОбъектСсылка);
	Если УстановившийПодпись <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И ЭП.УстановившийПодпись = &УстановившийПодпись";
		Запрос.Параметры.Вставить("УстановившийПодпись", УстановившийПодпись);
	КонецЕсли;
	Если ДатаПодписи <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И ЭП.ДатаПодписи = &ДатаПодписи";
		Запрос.Параметры.Вставить("ДатаПодписи", ДатаПодписи);
	КонецЕсли;
	Если УникальныйИдентификатор <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И ЭП.ИД = &УникальныйИдентификатор";
		Запрос.Параметры.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
